SOAP API Methods/Automate Cases Creation/Create Cases as String Method Sample 1.xml



<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:createCasesAsString>
         <!--Optional:-->
         <tem:casesInfo><![CDATA[<BizAgiWSParam>
               <domain>domain</domain>
               <userName>admon</userName>
               <Cases>
                  <Case>
                     <Process>Process Name</Process>
                     <Entities>
                    <mProcessEntityName>
<!--A foreing key is specified for the new case to populate a relationship between the process entity and an existing record in the target entity-->				
                        <kmForeignKeySample key="140">
                            <xCollectionName> // Validate if this refers to a collection or master entity
                                <mCollectionMasterEntityName key="1234567">    
                                    <bDecisionMaker>true</bDecisionMaker>
                                    <CompletionDate>2022-12-13T12:12:12</CompletionDate>
                                    <dApprovalDate>2022-12-13T12:12:12</dApprovalDate>
                                    <sCustomerNeed>str1234</sCustomerNeed>
                                    <sParentAccountID>str1234</sParentAccountID>
                                    <sOpportunityID>str1234</sOpportunityID>
                                    <dPPMApprovalDate>2012-12-13T12:12:12</dPPMApprovalDate>
                                    <dStartDate>2022-10-13T12:12:12</dStartDate>
                                    <xCollectionName>
										<mCollectionMasterEntityName key="104">
											<sName>Prueba LMT Files Mgmt 2</sName>
											<bOmmited>false</bOmmited>
											<uFile>
											<File fileName="Nombre Archivo Prueba LMT 2.pdf">INSERT BASE 64 STRING HERE=</File>
											</uFile>
										</mCollectionMasterEntityName>
								</xCollectionName>
                                    <kpForeignKeyInsideCollection>1</kpForeignKeyInsideCollection>
                                    <cCurrencyAttribute>123.45</cCurrencyAttribute>
                                    <dDateAttribute>2012-12-13T12:12:12</dDateAttribute>   
                                    <dDateAttribute2>2012-12-13T12:12:12</dDateAttribute2>
                                    <sParentContactID>str1234</sParentContactID>
                                    <cBudgetAmount>123.45</cBudgetAmount>
                                    <bSelectedForReview>false</bSelectedForReview>
                                    <sName>Test sample text</sName>
                                </mCollectionMasterEntityName>
                            </xCollectionName>
                        </kmPartner>
                        <kpCaseType businessKey="sCode='MANAGE_PROJ'"/>
                    </mProcessEntityName>
                </Entities>
                  </Case>
               </Cases>
            </BizAgiWSParam>]]></tem:casesInfo>
      </tem:createCasesAsString>
   </soapenv:Body>
</soapenv:Envelope>